# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSet..::..Erase Method
VoltageTypeSet Class See Also
---
Removes a specified voltage type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	VoltageType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As VoltageType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	VoltageType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..VoltageTypeThe voltage type to be erased.
# ### Return Value
The number of voltage types that were erased from the set.
# See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace